generated/nova_request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Body>
    <ns1:erstellePreisAuskunft xmlns:ns1="http://nova.voev.ch/services/v14/preisauskunft">
      <ns1:PreisAuskunftRequest xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" ns1:kundenSegmenteGruppieren="false" xsi:type="ns1:VerbindungPreisAuskunftRequest">
        <ns1:clientIdentifier xmlns:ns3="http://nova.voev.ch/services/v14/base" ns3:leistungsVermittler="11" ns3:kanalCode="41" ns3:verkaufsStelle="16437" ns3:vertriebsPunkt="16437" ns3:verkaufsGeraeteId="236"/>
        <ns1:correlationKontext>
          <ns3:correlationId xmlns:ns3="http://nova.voev.ch/services/v14/base">87482634-560b-4da3-b6a1-155c37490fed</ns3:correlationId>
          <ns3:geschaeftsProzessId xmlns:ns3="http://nova.voev.ch/services/v14/base">1781786f-57ba-4e9a-bc29-287e2aa97f9a</ns3:geschaeftsProzessId>
        </ns1:correlationKontext>
        <ns1:angebotsFilter xmlns:ns3="http://nova.voev.ch/services/v14/vertriebsbase" xsi:type="ns3:TaxonomieFilter">
          <ns3:produktTaxonomie>Basistaxonomie</ns3:produktTaxonomie>
          <ns3:taxonomieKlassePfad>
            <ns3:klassenName>Einzelbillette</ns3:klassenName>
          </ns3:taxonomieKlassePfad>
        </ns1:angebotsFilter>
        <ns1:reisender ns1:alter="25" ns1:externeReisendenReferenzId="1234" ns1:reisendenTyp="PERSON"/>
        <ns1:verbindung ns1:externeVerbindungsReferenzId="ID-B21CADB1-34CA-4698-B18B-BF055C34A027_1_1">
          <ns1:segmentHinFahrt xmlns:ns3="http://nova.voev.ch/services/v14/vertrieb" ns3:einstieg="8507000" ns3:ausstieg="8504221" ns3:verwaltungsCode="000033" ns3:abfahrtsZeit="2023-05-01T15:53:00Z" ns3:ankunftsZeit="2023-05-01T16:27:00Z">
            <ns3:verkehrsMittel ns3:gattungsCode="IR" ns3:verkehrsMittelNummer="91066"/>
            <ns3:zwischenHaltContext ns3:uicCode="8507000" ns3:tripContext="PLANNED"/>
            <ns3:zwischenHaltContext ns3:uicCode="8504221" ns3:tripContext="PLANNED"/>
          </ns1:segmentHinFahrt>
        </ns1:verbindung>
        <ns1:verbindung ns1:externeVerbindungsReferenzId="ID-48AD66EF-B080-4D31-BB10-061FE9B41FF0_1_1">
          <ns1:segmentHinFahrt xmlns:ns3="http://nova.voev.ch/services/v14/vertrieb" ns3:einstieg="8507000" ns3:ausstieg="8504221" ns3:verwaltungsCode="000033" ns3:abfahrtsZeit="2023-05-01T16:08:00Z" ns3:ankunftsZeit="2023-05-01T16:56:00Z">
            <ns3:verkehrsMittel ns3:gattungsCode="S" ns3:verkehrsMittelNummer="91005"/>
            <ns3:zwischenHaltContext ns3:uicCode="8507000" ns3:tripContext="PLANNED"/>
            <ns3:zwischenHaltContext ns3:uicCode="8504221" ns3:tripContext="PLANNED"/>
          </ns1:segmentHinFahrt>
        </ns1:verbindung>
        <ns1:verbindung ns1:externeVerbindungsReferenzId="ID-7E27B56B-EA42-4E82-B197-2C2B78496DA9_1_3">
          <ns1:segmentHinFahrt xmlns:ns3="http://nova.voev.ch/services/v14/vertrieb" ns3:einstieg="8507000" ns3:ausstieg="8504300" ns3:verwaltungsCode="000033" ns3:abfahrtsZeit="2023-05-01T16:12:00Z" ns3:ankunftsZeit="2023-05-01T16:38:00Z">
            <ns3:verkehrsMittel ns3:gattungsCode="IR" ns3:verkehrsMittelNummer="91065"/>
            <ns3:zwischenHaltContext ns3:uicCode="8507000" ns3:tripContext="PLANNED"/>
            <ns3:zwischenHaltContext ns3:uicCode="8504300" ns3:tripContext="PLANNED"/>
          </ns1:segmentHinFahrt>
          <ns1:segmentHinFahrt xmlns:ns3="http://nova.voev.ch/services/v14/vertrieb" ns3:einstieg="8504300" ns3:ausstieg="8504221" ns3:verwaltungsCode="000011" ns3:abfahrtsZeit="2023-05-01T16:45:00Z" ns3:ankunftsZeit="2023-05-01T17:01:00Z">
            <ns3:verkehrsMittel ns3:gattungsCode="IC" ns3:verkehrsMittelNummer="91005"/>
            <ns3:zwischenHaltContext ns3:uicCode="8504300" ns3:tripContext="PLANNED"/>
            <ns3:zwischenHaltContext ns3:uicCode="8504221" ns3:tripContext="PLANNED"/>
          </ns1:segmentHinFahrt>
        </ns1:verbindung>
        <ns1:verbindung ns1:externeVerbindungsReferenzId="ID-ED31C304-C2A8-4009-BE5D-F8931DDEC711_1_3">
          <ns1:segmentHinFahrt xmlns:ns3="http://nova.voev.ch/services/v14/vertrieb" ns3:einstieg="8507000" ns3:ausstieg="8504483" ns3:verwaltungsCode="000033" ns3:abfahrtsZeit="2023-05-01T16:34:00Z" ns3:ankunftsZeit="2023-05-01T17:08:00Z">
            <ns3:verkehrsMittel ns3:gattungsCode="S" ns3:verkehrsMittelNummer="91052"/>
            <ns3:zwischenHaltContext ns3:uicCode="8507000" ns3:tripContext="PLANNED"/>
            <ns3:zwischenHaltContext ns3:uicCode="8504483" ns3:tripContext="PLANNED"/>
          </ns1:segmentHinFahrt>
          <ns1:segmentHinFahrt xmlns:ns3="http://nova.voev.ch/services/v14/vertrieb" ns3:einstieg="8504483" ns3:ausstieg="8504221" ns3:verwaltungsCode="000053" ns3:abfahrtsZeit="2023-05-01T17:12:00Z" ns3:ankunftsZeit="2023-05-01T17:25:00Z">
            <ns3:verkehrsMittel ns3:gattungsCode="S" ns3:verkehrsMittelNummer="91020"/>
            <ns3:zwischenHaltContext ns3:uicCode="8504483" ns3:tripContext="PLANNED"/>
            <ns3:zwischenHaltContext ns3:uicCode="8504221" ns3:tripContext="PLANNED"/>
          </ns1:segmentHinFahrt>
        </ns1:verbindung>
        <ns1:verbindung ns1:externeVerbindungsReferenzId="ID-873D381B-889F-4BED-97D6-2C9E268674CA_1_1">
          <ns1:segmentHinFahrt xmlns:ns3="http://nova.voev.ch/services/v14/vertrieb" ns3:einstieg="8507000" ns3:ausstieg="8504221" ns3:verwaltungsCode="000033" ns3:abfahrtsZeit="2023-05-01T16:53:00Z" ns3:ankunftsZeit="2023-05-01T17:27:00Z">
            <ns3:verkehrsMittel ns3:gattungsCode="IR" ns3:verkehrsMittelNummer="91066"/>
            <ns3:zwischenHaltContext ns3:uicCode="8507000" ns3:tripContext="PLANNED"/>
            <ns3:zwischenHaltContext ns3:uicCode="8504221" ns3:tripContext="PLANNED"/>
          </ns1:segmentHinFahrt>
        </ns1:verbindung>
      </ns1:PreisAuskunftRequest>
    </ns1:erstellePreisAuskunft>
  </soapenv:Body>
</soapenv:Envelope>
